export type ComplaintLocation = {
  id: string;
  name: string;
  address: string;
  phone: string;
  fax: string;
};

export const complaintLocations: ComplaintLocation[] = [
  {
    id: "hq",
    name: "บริษัท กลุ่มสมอทอง จำกัด (มหาชน) สำนักงานใหญ่",
    address:
      "บริษัท กลุ่มสมอทอง จำกัด (มหาชน)\n119/1 หมู่ที่ 10 ตำบลประสงค์\nอำเภอท่าชนะ จังหวัดสุราษฎร์ธานี 84170",
    phone: "+66 77 951 470",
    fax: "+66 77 951 472",
  },
  {
    id: "branch_thachana",
    name: "บริษัท กลุ่มสมอทอง จำกัด (มหาชน) สาขาท่าชนะ",
    address:
      "บริษัท กลุ่มสมอทอง จำกัด (มหาชน)\n199/2 หมู่ที่ 10 ตำบลประสงค์\nอำเภอท่าชนะ จังหวัดสุราษฎร์ธานี 84170",
    phone: "+66 77 951 470",
    fax: "+66 77 951 471",
  },
  {
    id: "branch_phanom",
    name: "บริษัท กลุ่มสมอทอง จำกัด (มหาชน) สาขาพนม",
    address:
      "บริษัท กลุ่มสมอทอง จำกัด (มหาชน)\n333 หมู่ที่ 6 ตำบลคลองชะอุ่น\nอำเภอพนม จังหวัดสุราษฎร์ธานี 84250",
    phone: "+66 77 951 444",
    fax: "+66 77 951 459",
  },
  {
    id: "branch_saraburi",
    name: "บริษัท กลุ่มสมอทอง จำกัด (มหาชน) สาขาสระบุรี",
    address:
      "บริษัท กลุ่มสมอทอง จำกัด (มหาชน)\n33/3 หมู่ที่ 1 ตำบลหนองโรง\nอำเภอหนองแค จังหวัดสระบุรี 18140",
    phone: "+66 36 679 902",
    fax: "+66 36 679 901",
  },
  {
    id: "al_palm",
    name: "บริษัท เอ แอล ปาล์ม จำกัด",
    address: "173-173/1 หมู่ที่ 4 ตำบลทุ่งตะไคร\nอำเภอทุ่งตะโก จังหวัดชุมพร",
    phone: "+66 36 679 902",
    fax: "+66 36 679 901",
  },
];
